Revit 2025 API
Rebar.CreateFreeForm Method
Overload List
Name | Description
CreateFreeForm(Document, Guid, RebarBarType, Element) |  Creates a free form rebar that can have constraints.
CreateFreeForm(Document, RebarBarType, Element, IList<CurveLoop>, RebarFreeFormValidationResult) |  Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
CreateFreeForm(Document, RebarBarType, Element, IList<IList<Curve>>, RebarFreeFormValidationResult) |  Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
Top
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace